# ReferenceArrayArray Class

---
An array that contains ReferenceArray objects.
SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBReferenceArrayArray
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ReferenceArrayArray : APIObject,
    	IEnumerable

    Public Class ReferenceArrayArray
    	Inherits APIObject
    	Implements IEnumerable

    public ref class ReferenceArrayArray : public APIObject,
    	IEnumerable

    type ReferenceArrayArray =
        class
            inherit APIObject
            interface IEnumerable
        end
The ReferenceArrayArray type exposes the following members.
| Name| Description
---|---|---
| ReferenceArrayArray| Initializes a new instance of the ReferenceArrayArray class
Top
| Name| Description
---|---|---
| IsEmpty| Test to see if the array is empty.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| Item| Gets or sets a ReferenceArray at a specified index within the array.
| Size| Returns the number of ReferenceArrays that are in the array.
Top
| Name| Description
---|---|---
| Append|
| Clear| Removes every ReferenceArray from the array, rendering it empty.
| Dispose| Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| ForwardIterator| Retrieve a forward moving iterator to the array.
| GetEnumerator| Retrieve a forward moving iterator to the array.
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| Insert|
| ReverseIterator| Retrieve a backward moving iterator to the array.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace